app/controllers/links_controller.rb

SELECT `links`.* FROM `links`
---
  def index
    @links = Link.all

SELECT `links`.* FROM `links` WHERE `links`.`id` = 1 LIMIT 1
SELECT `lists`.* FROM `lists` INNER JOIN `links_lists` ON `lists`.`id` = `links_lists`.`list_id` WHERE `links_lists`.`link_id` = 10
---
  def show
    @link = Link.find(params[:id])
    @lists = Link.find(params[:id]).lists.all

SELECT `links`.* FROM `links` WHERE `links`.`id` = 3 LIMIT 1
---
  def edit
    @link = Link.find(params[:id])

INSERT INTO `links` (`created_at`, `name`, `timer_daily`, `timer_hms`, `timer_monthly`, `timer_specific_month`, `updated_at`, `url`) VALUES ('2011-12-18 03:42:32', 'Neopets', 0, '2000-01-01 00:30:00', 0, NULL, '2011-12-18 03:42:32', 'http://www.neopets.com/')
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save

SELECT `links`.* FROM `links` WHERE `links`.`id` = 3 LIMIT 1
UPDATE `links` SET `url` = 'http://jrlwjlrw', `updated_at` = '2011-12-18 19:29:36' WHERE `links`.`id` = 3
---
  def update
    @link = Link.find(params[:id])

    respond_to do |format|
      if @link.update_attributes(params[:link])

SELECT `links`.* FROM `links` WHERE `links`.`id` = 4 LIMIT 1
DELETE FROM `links` WHERE `links`.`id` = 4
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy